Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalSurfaceCannotMove Property
 Cannot move analytical surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AnalyticalSurfaceCannotMove { get; }
Public Shared ReadOnly Property AnalyticalSurfaceCannotMove As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AnalyticalSurfaceCannotMove {
	FailureDefinitionId^ get ();
}
static member AnalyticalSurfaceCannotMove : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace